       // SQL Error Status Fields (Numeric Order)
     D SQL_SUCCESS     C                   CONST('00000')
     D SQL_NO_MORE_ROWS...
     D                 C                   CONST('02000')
     D SQL_DUPLICATE_RECORD...
     D                 C                   CONST('23505')
     D SQL_ROW_LOCKED...
     D                 C                   CONST('57033') 