       // **********************************************************************
       // Copybook for misc commands

     D*--------------------------------------------------
     D* Procedure name: ExecClCmd
     D* Purpose:        Execute a CL command
     D* Returns:
     D* Parameter:      Cmd
     D*--------------------------------------------------
     D ExecClCmd       PR
     D                            32767A   CONST 